'''Виконайте переведення одиниць вимірювання відстаней. Значення відстані
вказано у метрах. У кожному новому рядку програма виводить значення відстані, п
редставлене у: дюймах, футах, милях, ярдах тощо. Числові дані на екрані мають
бути у відформатованому вигляді: два знаки після десяткової точки. Використайте
функцію format(). Потрібні значення одиниць вимірювання знайдіть у мережі
Інтернет.'''
distance = float(input('Enter your distance: '))
inch= distance * 39.3701
foot= distance * 3.28084
mile= distance * 0.000621371
yard= distance * 1.09361

print('{0:.2f} \n{1:.2f} \n{2:.2f} \n{3:.2f}'.format(inch, foot, mile, yard))
