'''Виконайте перетворення значення температури у градусах Цельсія (C) для інших
температурних шкал: Фаренгейта (F) і Кельвіна (K). Програма повинна відображати
еквівалентну температуру у градусах Фаренгейта (F = 32 + 9/5 * C). Програма
повинна відображати еквівалентну температуру у градусах Кельвіна(K= C + 273,15).
Результати потрібно вивести на екран у відформатованому вигляді: з
використанням двох знаків після десяткової точки, мінімальною довжиною поля
(15), вирівнюванням по центру. Зверніть увагу, у числах для розділення
дробової і цілої частин використовують точку.'''

C = float(input('Enter your temperature: '))
F = (32 + 9/5*C)
K = (C + 237.15)

print('{0:^15.2f} Celius = {1:^15.3f} Fahrenheit = {2:^15.3f} Kelvin'.format(C, F, K))
