'''
За координатами широти і довготи двох точок на Землі у градусах визначте відстань між ними у кілометрах. 
Нехай (x1, y1) і (x2, y2) є кординатами широти і довготи (у градусах) двох точок на земній поверхні. 
Відстань між цими точками у кілометрах обчислюється так: 
6371.032 × arccos(sin(x1) × sin(x2) + cos(x1) × cos(x2) × cos(y1 - y2)). Значення 6371,032 - 
це середній радіус Землі у кілометрах. Тригонометричні функції Python працюють з радіанами. 
Як результат, необхідно перетворити значення координат із градусів у радіани перед обчисленням відстані 
за формулою. Модуль math містить функцію з ім’ям radians(), яка переводить градуси у радіани. 
Переведення можна зробити і за формулою, на зразок x1 = x1 × pi/180, де pi - число Пі. 
Знайдіть відстань між двома містами Пекін (39.9075000, 116.3972300) і Київ (50.4546600, 30.5238000) 
і виведіть значення на екран. Значення відстані повинне відображатися у відформатованому вигляді: 
з використанням трьох знаків після десяткової крапки, мінімальною довжиною поля (10), вирівнюванням 
за правим краєм. На даному сайті знайдіть значення координат у десяткових градусах ще для кількох пар 
міст на вибір і визначте відстань у кілометрах між ними. Перевірте правильність визначення відстаней 
між містами, використовуючи один із сервісів вищезгаданого сайту.
'''
import math
r = 6371.032
x1 = 39.9075000
y1 = 116.3972300
x2 = 50.4546600
y2 = 30.5238000

x1 = x1 * math.pi/180
y1 = y1 * math.pi/180
x2 = x2 * math.pi/180
y2 = x2 * math.pi/180
y2 =math.radians(y2)

d1 = math.sin(x1)
d2 = math.sin(x2)
d3 = math.cos(x1)
d4 = math.cos(x2)
delta = math.cos(y1 - y2)
distance = r * math.acos(d1 * d2 + d3 * d4 * delta)

print('Distance: {0:>10.3f}'.format(distance))
#'{0:10d} {1:10f} {2:10s}'.format(n, f, s)