# Виведіть імена видатних особистостей України, зображених на грошових знаках. 
# Користувач вводить номінал банкноти . Програма виводить значення номіналу і ім’я 
# особи, яка зображена на цій банкноті. Якщо користувач вводить неіснуюче значення 
# номіналу, на екран виводиться відповідне повідомлення.
def note_value(value):
    if value == 1:
        print("Володимир Великий")
    elif value == 2:
        print(" Ярослав Мудрий")
    elif value == 5:
        print("Богдан Хмельницький")
    elif value == 10:
        print("Іван Мазепа")
    elif value == 20:
        print("Іван Франко")
    elif value == 50:
        print("Михайло Грушевський")
    elif value == 100:
        print("Тарас Шевченко")

note_value(20)
note_value(100)