#403. Створіть список years_list, що містить рік, в який ви народилися, і кожен наступний рік аж до 
# вашого п’ятого дня народження. Наприклад, якщо ви народилися в 1995 році, список буде виглядати так: 
# years_list = [1995, 1996, 1997, 1998, 1999, 2000]. Виведіть на екран, у якому із років, що міститься у 
#списку years_list, вам виповнилося 3 роки? Пам’ятайте, у перший рік вам було 0 років. Додайте у кінець 
# списку ще один рік і виведіть список на екран. У якому із років, перерахованих у списку years_list, 
# вам було найбільше років?


years_list = [1980, 1981, 1982, 1983, 1984, 1985]

print(years_list[3])
years_list.append(1986)
print(years_list)
print(years_list[-1])
