# Конвертуйте десяткове число (з основою 10) у бінарне (двійкове, з основою 2). 
# Користувач вводить десяткове число як ціле, а потім використовується алгоритм поділу 
# (псевдокод), показаний нижче, щоб виконати перетворення. Коли алгоритм завершується, 
# результат містить двійкове подання числа. Програма має вивести відповідне 
# повідомлення, на зразок: 2018 in Decimal is 11111100010 in Binary. Модифікуйте 
# програму таким чином, щоб вона виконувала зворотну операцію: перетворювала двійкове 
# чиcло у десяткове.

def number_convertor(num):
    result = ''
    q = num
    while q != 0:
        r = q % 2
        result += str(r)
        q = q // 2
        be_result = result[::-1]
    print(f'{num} in Decimal is {be_result} in Binary')

number_convertor(2023)
number_convertor(2018)