# Реалізуйте шифр Цезаря. 
# Кожна буква в оригінальному повідомленні зміщується на 3 позиції. 
# В результаті A стає D, B стає E, C стає F, D стає G і т. д. 
# Останні три букви у алфавіті повертаються до початку: 
# X стає A, Y стає B, а Z стає C. Нелітерні символи не враховуються шифром. 
# Користувач вводить з клавітури повідомлення та зсув, а потім програма відображає 
# зашифроване повідомлення. Переконайтеся, що програма шифрує як великі та малі 
# літери. Програма також повинна підтримувати значення негативних зсувів, 
# щоб її можна було використовувати як для кодування повідомлень, так і для 
# декодування повідомлень. 
#У нагоді стануть такі функції: ord() (перетворює символ у номер позиції цього 
# символу у таблиці ASCII ) і chr() (перетворює номер позиції символу у таблиці ASCII 
# у відповідний символ).

def cesar_script(text, shift):
    lst = list(text)

    for i in lst:
        i = ord(i)
        new_i = i + shift
        print(chr(new_i),end = '')
    print()

cesar_script('khoor', -3)
cesar_script('hello', 3)
cesar_script('hello', 5)