# Порядкові числівники у англійській мові закінчуються суфіксом th 
# (окрім 1st, 2nd і 3rd). Cтворіть список чисел від 1 до 9. Використайте ланцюжок 
# if-elif-else у циклі для виведення правильного закінчення числівника для кожного 
# числа. Програма повинна виводити числівники 1st 2nd 3rd 4th 5th 6th 7th 8th 9th, 
# кожен у новому рядку.
num_list = [1,2,3,4,5,6,7,8,9]
for num in num_list:
    if num == 1:
        print('1st')
    elif num == 2:
        print('2nd')
    elif num == 3:
        print('3rd')
    else:
        print(str(num) + 'th')