# 395. Дано рядок, який, можливо, містить пропуски. Визначте кількість слів у цьому рядку. 
# Слово - це кілька поспіль букв англійського алфавіту (як великих, так і малих). 
# При розв’язуванні цього завдання не можна користуватися списками.
"""
Вхідні дані:
Do you play any sports? Yes, I like to play basketball.

Вихідні дані:
10
"""

txt = input("Enter a string: ")
print(txt)
print(len(txt.split()))
print(type(txt))