#96. З початку доби годинникова стрілка повернулася на кут a градусів. 
#Визначте на який кут повернулась хвилинна стрілка з початку останньої години. 
#Вхідні і вихідні дані - дійсні числа. 
#При розв’язуванні цього завдання не можна користуватися умовними конструкціями і циклами.

'''
h = int(input('Enter a number from 0 to 60: '))  #2
m = int(input('Enter a number from 0 to 60: '))  #10
s = int(input('Enter a number from 0 to 60: '))  #45

time = h * 60 * 60 + m * 60 + s
grad = 360 / (12 * 60 * 60)
angle = time * grad                              # 65.375
print(angle)
'''
angle = 65.375


time = h * 60 * 60 + m * 60 + s
grad = 360 / (12 * 60 * 60)
angle = time * grad                              # 65.375
print(angle)