# 483. Напишіть програму, яка виводить частину послідовності 
# 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5... (число повторюється стільки разів, чому дорівнює). 
# На вхід програми передається невід’ємне ціле число n - стільки елементів 
# послідовності повинна надрукувати програма. На виході очікується послідовність 
# чисел, записаних через пропуск в один рядок.
'''
Вхідні дані:
8

Вихідні дані:
1 2 2 3 3 3 4 4
'''
char = int(input("Enter a number: "))
for i in range(1,char+1):
    print(((str(i) + " ") * i),end = "")