# 574. Напишіть програму, яка вміє шифрувати і розшифровувати використовуючи шифр 
# підстановки. Програма приймає на вхід два рядки однакової довжини, у першому рядку 
# записані символи початкового алфавіту, у другому рядку - символи кінцевого алфавіту 
# (шифр підстановки), після чого йде рядок, який потрібно зашифрувати переданим шифром 
# підстановки, і ще один рядок, який потрібно розшифрувати. Нехай, наприклад, 
# на вхід програми передано:
# abcd
# *d%#
# abacabadaba
# #*%*d*%

# Це означає, що символ a вхідного повідомлення замінюється на символ * в шифрі, b 
# замінюється на d, c - на % і d - на #. Потрібно зашифрувати рядок abacabadaba і 
# розшифрувати рядок #*%*d*% за допомогою цього шифру. Отримуємо наступні рядки, які і 
# передаємо на виведення програми:

# *d*%*d*#*d*
# dacabac
"""
Вхідні дані:

abcd
1234
ababcdcd
44332211

Вихідні дані:
12123434
ddccbbaa
"""
row_1 = input("Enter your row_1: ")
row_2 = input("Enter your row_2: ")
row_3 = input("Enter your row_2: ")
row_4 = input("Enter your row_2: ")

row_1, row_2 = row_2, row_1
print(row_1, row_2)
print(row_3, row_4)