#82.Електронний годинник показує час в форматі h: mm: ss, тобто спочатку
#записується кількість годин (число від 0 до 23, потім обов’язково двозначна
#кількість хвилин, потім обов’язково двозначна кількість секунд. Кількість
#хвилин і секунд при необхідності доповнюються додвозначного числа нулями. З
#початку доби минуло n секунд. Виведіть, що покаже годинник.

n = int(input('Enter a number of second: '))
hh = n // 60 // 60 % 24
mm = n // 60 % 60
sec = n % 60
print('{0:0>2d}:{1:0>2d}:{2:0>2d}'.format(hh,mm,sec))
