# 532. Написати програму, в якій зберігаються дані про товари, їх кількість і ціну. 
# При запуску програми ця інформація виводиться на екран. Далі користувачеві має 
# пропонуватися вводити номера товарів і їх нову кількість. Введення даних має 
# завершуватися, якщо користувач вводить обумовлений символ (наприклад, нуль). 
# Після цього всі дані про товари повинні знову виводитися на екран. 
#Якщо номер товару відсутній, необхідно вивести відповідне повідомлення 
# як у вихідних даних.
'''
Вхідні дані:
9
product missing
2
10
0

Вихідні дані:
1 Core-i3-4330 9 4500
2 Core i5-4670K 3 8500
3 AMD FX-6300 6 3700
4 Pentium G3220 8 2100
5 Core i5-3450 5 

1 Core-i3-4330 9 4500
2 Core i5-4670K 10 8500
3 AMD FX-6300 6 3700
4 Pentium G3220 8 2100
5 Core i5-3450 5 6400
'''
tech = {1:['Core-i3-4330', 9, 4500],\
        2:['Core i5-4670K',3, 8500],\
        3:['AMD FX-6300', 6, 3700],\
        4:['Pentium G3220',8, 2100],\
        5:['Core i5-3450', 5, 6400]
        }

for key, value in tech.items():
    print(f"{key} {value[0]} {value[1]} {value[2]}")

data = input("Enter the number and q-ty to update through the spacebar:").split()
print(type(data))
print(data)