# 415. Виведіть всі елементи списку з непарними індексами. Вводиться список чисел, 
# елементи якого розділені комами без пропусків. Всі числа списку знаходяться на 
# одному рядку. Необхідно вивести список в одному рядку і елементи списку мають бути 
# розділені комами без пропусків.
'''
Вхідні дані:
1,2,3,4,5,6,7,8,9

Вихідні дані:
1,3,5,7,9
'''
lst1 = []
lst1 = [int(item) for item in input("Enter the list items : ").split(',')]

for i in lst1:
    if lst1.index(i)%2 == 0:
        print(i,end=',')
print()