# 261. Напишіть програму, яка зчитує числа (по одному в рядку) до тих пір, поки сума введених чисел 
# не буде дорівнювати 0 і відразу після цього виводить суму квадратів всіх введених чисел. Гарантується, 
# що в якийсь момент сума введених чисел дорівнюватиме 0, після цього зчитування продовжувати не потрібно.
'''
Вхідні дані:

2
-4
6
-17
12
10
-9

Вихідні дані:

670
'''
num_list = []
while True:
    a = int(input("Enter a number: "))
    num_list.append(a)
    
    if sum(num_list) == 0:
        squared_list =[]
        for i in num_list:
            i = (pow(i,2))
            squared_list.append(i)
        print(sum(squared_list))
        break  