# 264. Старшокласники брали участь у вікторині з інформатики. Необхідно було відповісти на 20 питань. Переможцем вікторини вважається учасник, 
# який правильно відповів на найбільшу кількість запитань. На скільки питань переможець відповів правильно? Якщо є учасники вікторини, 
# які не змогли дати правильну відповідь ні на одне із запитань, виведіть Yes, інакше виведіть No. Гарантується, що є учасники, які правильно 
# відповіли хоча б на одне запитання. Программа отримує на вхід число учасників вікторини n (1 ≤ n ≤ 50), потім для кожного учасника вводиться 
# кількість питань, на які отримано правильну відповідь.
'''
Вхідні дані:

5
10
15
7
0
16

Вихідні дані:

16
Yes

'''
