# 559. На вхід програми подається послідовність чисел від 1 до 9, що закінчується 
# нулем. Всього буде введено не більше 100000 чисел. Підрахуйте в цій послідовності 
# кількість одиниць, кількість двійок, кількість трійок і т. д. і надрукуйте результат. 
# У вихідних даних завжди має бути 9 чисел.
'''
Вхідні дані:
1 1 4 1 5 8 6 3 5 1 0

Вихідні дані:
4 0 1 1 2 1 0 1 0
'''
counts = [0] * 9
numbers = list(map(int,input("Enter a sequence: ").split()))
for num in numbers:
    if num == 0:
        break
    counts[num-1]+= 1
for count in counts:
    print(count, end = ' ')
print()