# 605. Сашко і Оленка грають в гру. Сашко загадав натуральне число від 1 до n. Оленка 
# намагається вгадати це число, для цього вона називає деякі послідовності натуральних чисел. 
# Сашко відповідає Оленці YES, якщо серед названих нею чисел є задумане або NO в іншому випадку. 
# Після декількох заданих питань Оленка заплуталася в тому, які питання вона задавала і які 
# відповіді отримала і просить вас допомогти їй визначити, які числа міг задумати Сашко. Перший 
# рядок вхідних даних містить число n - найбільше число, яке міг загадати Сашко. Далі йдуть 
# рядки, які містять питання Оленки. Кожен рядок представляє собою набір чисел, розділених 
# пропусками. Після кожного рядка з питанням йде відповідь Сашка: YES або NO. Нарешті, останній 
# рядок вхідних даних містить одне слово HELP. Ви повинні вивести (через пропуск, в порядку 
# зростання) всі числа, які міг задумати Сашко.
"""
Вхідні дані:
12
1 2 3 5 7 9
YES
3 7 9 11 12
NO
HELP

Вихідні дані:
1 2 5
"""

