#163. Уявіть будинок, побудований у футуристичному стилі, в якому є трикутні, прямокутні і круглі кімнати. 
#Щоб швидко обчислити площу житлового приміщення, потрібно написати програму, на вхід якої подаються тип кімнати 
#(трикутник (triangle), прямокутник (rectangle), коло (circle)) та відповідні параметри, за допомогою яких можна 
#обчислити площу кімнати вказаної форми. Зверніть увагу, що кількість параметрів для обчислення площі для різних 
#фігур є різною. Для числа Пі використовуйте значення 3.14.

room = input("Enter the room's form: ")

if room == "triangle":
    a = int(input("Enter an a:"))
    h = int(input("Enter an h: "))
    S = 1 / 2 * (a * h)
elif room == "rectangle":
    a = int(input("Enter a:"))
    b = int(input("Enter b:"))
    S = a * b
elif room == "circle":
    r = int(input("Enter r: "))
    S = 3.14 * r ** 2
print(S)