#27.Необхідно певну суму грошей залишити на банківському рахунку, щоб отримувати
#відсотки по закінченню певного часу. Наприклад, через 10 років ви хотіли б
#отримати 10 000 доларів США на власному рахунку. Скільки потрібно внести грошей
#на депозит сьогодні, щоб це сталося?
#Для розв’язування цієї задачі можна
#використовувати формулу p = f/(1+r)*n,
#де p - це поточна сума, яку потрібно внести сьогодні,
#f - майбутнє значення, яке ви хочете отримати
#(у нашому випадку становить 10 000 доларів США),
#r - річна відсоткова ставка,
#n - кількість років перебування грошей на рахунку.


f = float(input('Enter the desired future value: '))
r = float(input('Enter the annual interest rate: '))
n = int(input('Enter the number of years the money will grow: '))
p=(f/(1+r))*n

print('You will need to deposit this amount: ',p)
