#У книзі на одній сторінці поміщається k рядків. Таким чином, на 1-й сторінці друкуються рядки з 1-го по k-й, 
#на другій сторінці - з (k + 1)-й по (2 * k)-й і т. д. Напишіть програму, на вхід якої подається кількість 
#рядків k на сторінці і номер рядка n в тексті, по якому визначається номер сторінки, на якій буде надрукований 
#цей рядок, і порядковий номер цього рядка на сторінці.
import math
k = int(input('Enter a q-ty of rows per page: '))  #20
n = int(input('Enter a row\'s number: '))          #25

p = n / k
r = n % k

print (math.ceil(p), r)