# 375. В операційній системі Windows шлях до файлу складається з імені логічного 
# диска і назв каталогів, в яких знаходиться цей файл. Частини шляху розділені знаками 
# \ (зворотний слеш). Потрібно розбити заданий шлях до файлу на частини - ім’я диска і 
# назви каталогів. Програма повинна вивести ім’я диска і назви всіх каталогів, що 
# становлять шлях. Кожен елемент виводиться в окремому рядку. Використовувати модулі 
# не можна.
'''
Вхідні дані:
C:\Python36\python.exe

Вихідні дані:
C:
Python36
python.exe
'''
txt = input("Enter a string: ")

x = txt.split("\\")
for i in x:
    print(i)
