# 498. Кодування довжин послідовностей - це базовий алгоритм стиснення даних. Реалізуйте 
# алгоритм дешифрування (декодування) рядків, закодованих за допомогою одного з найпростіших 
# варіантів кодування довжин послідовностей. На вхід алгоритму подається рядок, що містить 
# цифри і символи англійського алфавіту. Цей рядок розбивається на так звані серії 
# (послідовності), які кодуються парою число-символ або просто символ (в такому випадку 
# число вважається рівним одиниці). Результат повинен містити ці серії в тому ж порядку, що 
# вони і зустрічаються в заданому рядку, при цьому кожна серія розгортається в послідовність 
# символів відповідної довжини. Наприклад, закодований рядок 3ab4c2CaB розбивається на серії 
# 3a b 4c 2C a B, після чого, перетворюючи серії, отримуємо початковий розкодований рядок 
# aaabccccCCaB.
"""
Вхідні дані:
3ab4c2CaB
10a3b2c4DFj5h

Вихідні дані:
aaabccccCCaB
aaaaaaaaaabbbccDDDDFjhhhhh
"""

