#127. Дату 2 жовтня 2020 р. будемо називати «магічною», оскільки, коли вона записана у форматі 02.10.20, 
#добуток значень дня і місяця дорівнюють значенню року. Напишіть програму, яка запропонує користувачеві ввести день, 
#місяць і рік (лише останні дві цифри) у числовій формі. Програмі слід вивести повідомлення про те, 
#що введена дата є «магічною». В іншому випадку має бути повідомлення, що це звичайна дата.

day = int(input('Enter a day: '))
month = int(input('Enter a month: '))
year = int(input('Enter a year(two last number): '))
if day * month == year:
    print('It is a magic!')
else:
    print('It is obvious.')