#95. З початку доби минуло h годин, m хвилин, s секунд (0 < h < 12, 0 < m < 60, 0 < s < 60). 
#За даними числами h, m, s визначте кут (в градусах), на який повернулаcь годинникова стрілка з початку доби і 
#виведіть його у вигляді дійсного числа. 
#При розв’язуванні цього завдання не можна користуватися умовними конструкціями і циклами.

h = int(input('Enter a number from 0 to 60: '))  #2
m = int(input('Enter a number from 0 to 60: '))  #10
s = int(input('Enter a number from 0 to 60: '))  #45

time = h * 60 * 60 + m * 60 + s
grad = 360 / (12 * 60 * 60)
angle = time * grad                              # 65.375
print(angle)
