# 561. Потрібно написати програму, яка здійснює перетворення з однієї одиниці 
# вимірювання довжини в інші. Повинні підтримуватись
# милі (1 mile = 1609 m)
# ярди (1 yard = 0.9144 m)
# фути (1 foot = 30.48 cm)
# дюйми (1 inch = 2.54 cm)
# кілометри (1 km = 1000 m)
# метри (m)
# сантиметри (1 cm = 0.01 m)
# міліметри (1 mm = 0.001 m)
# Використовуйте саме зазначені в формулюванні завдання одиниці виміру з вказаною 
# точністю. Вводиться один рядок з фразою такого виду <number> <unit_from> in 
# <unit_to> Програма має вивести дробове число в експоненційному форматі, 
# з точністю рівно два знаки після десяткової крапки.
'''
Вхідні дані:
15.5 foot in mile
15.5 mile in km
15.5 mile in inch

Вихідні дані:
2.94e-03
2.49e+01
9.82e+05
'''
