# 379. Дано послідовність символів довжини n (n ≥ 1). Перевірити баланс круглих 
# дужок в цьому виразі (кожна відкита дужка має свою закриту дужку). Наприклад, при 
# введенні виразу (()) () програма повинна повідомити про правильність розстановки 
# дужок (True), а при введенні виразу ((()) - про неправильність (False). Напишіть 
# програму, яка може перевіряти баланс дужок в арифметичних виразах, тексті і т. д.
'''
Вхідні дані:
(3y + 21)(12 - (x + 5))
(61x + 15(y + 2)

Вихідні дані:
True
False
'''
txt = input("Enter a string: ")
right = 0
left = 0
for i in txt:
    if i == "(":
        right += 1
    elif i ==")":
        left += 1
    else:
        pass
if right == left:
    print(True)
else:
    print(False)

