# 400. Дано рядок, який може містити пропуски. Визначте, чи є цей рядок паліндромом, 
# за умови, що великі і малі літери не розрізняються, а всі символи, які не є буквами, 
# повинні бути пропущені. Виведіть слово Yes, якщо слово є паліндромом і слово No, якщо ні. 
# Довжина вхідного рядка може бути до 100000 символів. При виконанні цього завдання не 
# можна використовувати списки.
"""
Вхідні дані:
Was.it.a.rat.I.saw?
Rio-de-Janeiro!
a+b=b+a

Вихідні дані:
Yes
No
Yes
"""
text = input("Enter your text: ")
new_text = ""
for i in text:
    if i.isalpha():
        new_text += i
        new_text = new_text.lower()
#print(new_text)

if new_text == new_text[::-1]:
    print("Yes")
else:
    print("No")
