# 472.Дано список слів. Напишіть програму, яка виконає заміну останніх трьох 
# символів слів, що мають певну довжину, на певний символ. Користувач відповідно 
# вводить наступні дані: кількість слів у списку, довжину слів, які будуть 
# редагуватися, символ заміни останніх тьох символів і сам список слів (кожне слово 
# в окремому рядку). Гарантовано, що довжина слів у списку щонайменше 3 символи.
'''
Вхідні дані:
4
5
%
writer
painter
programmer
scientist

Вихідні дані:
['wri%', 'pain%', 'program%', 'scient%']
'''
lst =['writer','painter','programer','scientist']
for i in lst:
    i.pop()
    i.pop()
    i.pop()
print(lst)