#231. Пароль доступу до комп’ютера зберігається у змінній n - ціле число, яке вводить користувач. 
# Напишіть програму, яка запитує пароль в користувача. У разі введення користувачем неправильного пароля 
# на екран має виводитися повідомлення Error, після чого дії повинні повторюватися до введення правильного 
# значення. При успішній аутентифікації в ситемі має з’явитися повідомлення Done.


n = int(input("Enter your password: "))
while True:
    n_1 = int(input("Enter your password: "))
    if n_1 != n:
        print("Error")
    elif n_1 == n:
        print("Done")
        break

