# 273. Напишіть програму, яка допомагає знайти число (НСК - найменше спільне кратне) двох чисел. 
# Програма повинна зчитувати два додатних цілих числа a і b (кожне число вводиться на окремому рядку) і 
# виводити найменше число, яке ділиться на обидва цих числа без залишку. НСК(a, b) = |ab| / НСД(a, b), 
# де НСД(a, b) - найбільший спільний дільник чисел a, b.
'''
Вхідні дані:

8
5

Вихідні дані:

40
'''



a = int(input("Enter a number: "))
b = int(input("Enter a number: ")) 

def gcd(a, b):
    if b == 0:
        return a
    return gcd(b, a % b)

gcd_value = gcd(a, b)
lcm_value = abs(a* b) // gcd_value
print(lcm_value)