# 660. Напишіть функцію для перевірки, чи є число ідеальним чи ні. Примітка. 
# У теорії чисел ідеальне число - це додатне ціле число, яке дорівнює сумі власних 
# додатних дільників, тобто сумі додатних дільників, виключаючи саме число. 
# Відповідно, ідеальне число - це число, що дорівнює половині суми всіх додатних 
# дільників (включаючи саме число). Наприклад: перше ідеальне число - 6, 
# оскільки 1, 2 і 3 - це правильні додатні дільники, а 1 + 2 + 3 = 6. 
# Відповідно, число 6 дорівнює половині суми всіх його додатних дільників: 
# (1 + 2 + 3 + 6) / 2 = 6. Наступне ідеальне число - 28 = 1 + 2 + 4 + 7 + 14. 
# Далі ідуть ідеальні числа 496 і 8128.
'''
Вхідні дані:
6
28
25

Вихідні дані:
True
True
False
'''
def ideal_num(num):
    dividers = []
    for i in range(1,num):
        if num % i == 0:
            dividers.append(i)
            i +=1
    #print(dividers)

    if (sum(dividers) + num) / 2 == num:
        print(True)
    else:
        print(False)

ideal_num(6)
ideal_num(28)
ideal_num(25)
ideal_num(496)
ideal_num(497)