#201. Для даного числа n < 100 необхідно закінчити фразу «На лузі пасеться…​» одним з можливих продовжень: 
#n корів, n корова, n корови, правильно обравши закінчення. Вводиться натуральне число. Програма повинна вивести 
#введене число n і одне зі слів: koriv, korova або korovy. Між числом і словом повинен стояти один пропуск.


n = int(input("Enter a number: "))
if (n % 10) == (1 % 10):                        # 21 31 41 51 61 71 81 91 
    print("korova")
elif 2 <= n % 10 <= 4:                          # 22 23 24 32 33 34 42 43 44 
    print("korovy")
elif 5 <= n <=20 :                              # 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
    print("koriv")
elif 5 <= (n % 10) <= 9:                        # 25 26 27 28 29  35 36 37 38 38  45 46 47 48 49 
    print("koriv")
elif n % 10 == 0:                               # 30 40 50 60 70 80 90 
    print("koriv")
