# 300. В одній країні використовуються грошові купюри номіналом 
# в 1, 2, 4, 8, 16, 32 і 64. 
# Дано натуральне число n. Якою найменшою кількістю таких грошових знаків можна 
# виплатити суму n (вказати кількість кожної з використовуваних для виплати купюр)?
# Передбачається, що є досить велика кількість купюр всіх номіналів.
'''
Вхідні дані:

165

Вихідні дані:

2 (64)
1 (32)
1 (4)
1 (1)
'''
def find_min_notes(n):
    notes=[64,32,16,8,4,2,1]
    count = [0]*len(notes)
    for i in range(len(notes)):
        count[i]=n//notes[i]
        n%=notes[i]
        if n == 0:
            break
    return count