# 378. Дано рядок. Розріжте його на дві «рівні» частини (якщо довжина рядка непарна, 
# помістіть центральний символ у першу частину, так що перша частина міститиме на один 
# символ більше, ніж друга частина). Тепер надрукуйте новий рядок, у якому перша та 
# друга половини обмінялися місцями (не використовуйте вказівку «якщо» для цього 
# завдання).
'''
Вхідні дані:
country
town

Вихідні дані:
trycoun
wnto
'''
txt = input("Enter a string: ")

half_2 = len(txt)//2
half_1 = len(txt) - half_2

print(half_1)
print(half_2)

print(txt[:half_2])
print(txt[half_1:])

print(txt[half_1:] + txt[:half_2])