# 540.Дано два словники, в яких ключами є малі букви латинського алфавіту, 
# а значеннями - цілі числа. В першому словнику можуть зустрічатися ключі чи значення, 
# які присутні в другому словнику, або навпаки. 
# Наприклад, вміст словників може бути наступний: 
# a = {'x' : 1, 'y' : 2, 'z' : 3}, b = {'w' : 10, 'x' : 11, 'y' : 2}. 
# Надрукуйте ключі, які присутні в першому словнику, але яких немає в другому, 
# в одному рядку через пропуск.
'''
Вхідні дані:
Немає

Вихідні дані:
z
'''

a = {'x' : 1, 'y' : 2, 'z' : 3}
b = {'w' : 10, 'x' : 11, 'y' : 2}

set_1 = set(list(a.keys()))
set_2 = set(list(b.keys()))

for i in (set_1.difference(set_2)):
    print(i)
print()
