# 646. Дано п’ять дійсних чисел: x, y, xc, yc, r. Напишіть функцію для перевірки, 
# чи належить точка (x, y) колу з центром (xc, yc) і радіусом r. Якщо точка належить 
# колу, виведіть слово YES, інакше виведіть слово NO. Функція не повинна містити 
# інструкцію «якщо».
'''
Вхідні дані:
0
0
2
2
3
1
1
4
5
3

Вихідні дані:
YES
NO
'''
def circle_func(x, y, xc, yc, r):
    result = "YES" if ((x - xc)**2 + (y - yc)**2 == r**2) else "NO"
    return result

print(circle_func(0,0,2,2,3))
print(circle_func(1,1,4,5,3))
print(circle_func(0,0,4,3,5))