# 322. З клавіатури вводиться два цілих числа a і b. Напишіть програму, 
# яка порівнює ці числа і в залежності від результату порівняння виводить 
# на екран потрібний вираз, наприклад: 3 < 5 або 3 = 3 або 3 > 2. 
# Команду print для виведення результату дозволяється використовувати лише один раз.
'''
Вхідні дані:

10
15

Вихідні дані:

10 < 15

'''
num1 = int(input("Enter a number: "))
num2 = int(input("Enter a number: "))
if num1 < num2:
    print(str(num1) + ' < ' + str(num2))
elif num2 < num1:
    print(str(num2) + ' < ' + str(num1))
else:
    print(str(num2) + ' = ' + str(num1))