# 527. Використайте словник для виведення представлення букви, яку вводить 
# користувач, у символах азбуки Морзе. Передбачте у програмі обробку малих і 
# великих букв.
'''
Вхідні дані:
D
f

Вихідні дані:
-..
..-.
'''
morse_code = { 'A':'.-', 'B':'-...',
               'C':'-.-.', 'D':'-..', 'E':'.',
               'F':'..-.', 'G':'--.', 'H':'....',
               'I':'..', 'J':'.---', 'K':'-.-',
               'L':'.-..', 'M':'--', 'N':'-.',
               'O':'---', 'P':'.--.', 'Q':'--.-',
               'R':'.-.', 'S':'...', 'T':'-',
               'U':'..-', 'V':'...-', 'W':'.--',
               'X':'-..-', 'Y':'-.--', 'Z':'--..',
               '1':'.----', '2':'..---', '3':'...--',
               '4':'....-', '5':'.....', '6':'-....',
               '7':'--...', '8':'---..', '9':'----.',
                '0':'-----', ', ':'--..--', '.':'.-.-.-',
               '?':'..--..', '/':'-..-.', '-':'-....-',
               '(':'-.--.', ')':'-.--.-'}

def convert_to_morse_code(text):
    morse=''
    for char in text:
        if char.upper() in morse_code:
            morse += morse_code[char.upper()] + ''
        else:
            morse += char + ''
    return morse.strip()

user_input = input("Enter a character: ")
morse_representation = convert_to_morse_code(user_input)
print(morse_representation)