#61.Оленка дізналася, що їй для сну треба t хвилин. На відміну від Тетяни,
#Оленка лягає спати після опівночі в h годин і m хвилин. Допоможіть Оленці
#визначити, на який час їй поставити будильник, щоб він продзвенів рівно через
#t хвилин після того, як вона ляже спати. Вокремомих рядках вводяться значення
#t,h і m відповідно. Гарантується, що Оленка повинна прокинутися в той же день,
#що і заснути.Програма повинна виводити час, на який потрібно поставити
#будильник: в першому рядку години, в другому - хвилини.

t = int(input('Enter time for sleep: '))
h = int(input('Enter hour to go to bed: '))
m = int(input('Enter minutes to go to bed: '))

t_1 = h * 60 + m
t_2 = t_1 + t
h_2 = t_2//60
m_2 = t_2%60

print(h_2)
print(m_2)
