# 606. Сашко і Оленка продовжують грати в гру, але Сашко почав шахраювати. На кожне з питань 
# Оленки він вибирає такий варіант відповіді YES або NO, щоб послідовність можливих задуманих 
# чисел залишалася якомога більшою. Наприклад, якщо Сашко задумав число від 1 до 5, а Оленка 
# запитала про числа 1 і 2, то Сашко відповість NO, а якщо Оленка запитає про 1, 2, 3, то Сашко 
# відповість YES. Якщо ж Оленка в своєму питанні перераховує рівно половину з задуманих чисел, 
# то Сашко завжди відповідає NO. Нарешті, Сашко при відповіді враховує всі попередні питання 
# Оленки і свої відповіді на них, тобто множина можливих задуманих чисел зменшується. Вам дано 
# послідовність питань Оленки. Наведіть відповіді Сашка на них. Перший рядок вхідних даних 
# містить число n - найбільше число, яке міг загадати Сашко. Далі йдуть рядки, які містять 
# питання Оленки. Кожен рядок представляє собою набір чисел, розділених пропусками. Останній 
# рядок вхідних даних містить одне слово HELP. Для кожного питання Оленки виведіть відповідь 
# Сашка на це питання. Після цього виведіть (через пропуск, в порядку зростання) всі числа, 
# які міг би загадати Сашко після відповіді на всі питання Оленки.
"""
Вхідні дані:
8
1 2 3 5 6
2 3 7 8
HELP

Вихідні дані:
YES
NO
1 5 6
"""