# 463.У якийсь момент вам набридло використовувати імена файлів з пропусками і ви 
# вирішили написати програму, яка перейменовує всі файли, що містять пропуски в імена,
# у яких групи прогалин замінено на символ підкреслення _. Програма отримує один 
# рядок, що містить довільні символи, в тому числі і пропуски, і виводить правильну 
# назву із символом підкреслення замість пропусків.
'''
Вхідні дані:
my file.txt
string     with        multi spaces
single

Вихідні дані:
my_file.txt
string_with_multi_spaces
single
'''
txt = input("Enter the list members: ").split()
txt_string = '_'.join(txt)
print(txt_string)

