# 572. Напишіть програму, яка приймає на вхід список ігор футбольних команд з результатом 
# матчу і виводить зведену таблицю результатів всіх матчів. За перемогу команді 
# нараховується 3 очки, за поразку - 0, за нічию - 1. Формат введення наступний: у першому 
# рядку вказано ціле число n - кількість завершених ігор. Після цього йде n рядків, 
# в яких записані результати гри в наступному форматі:

# 1_команда;забито_1_командою;2_команда;забито_2_командою

# Результати виведення програми необхідно оформити наступним чином:

# Команда: Всього_ігор Перемог Нічиїх Поразок Всього_очок

#Конкретний приклад введення-виведення наведено у вхідних і вихідних даних. 
#Порядок виведення команд довільний.
"""
Вхідні дані:
4
Ukraine;2;France;1
Italy;1;Germany;3
France;0;Italy;0
Germany;2;Ukraine;0

Вихідні дані:
Ukraine: 2 1 0 1 3
France: 2 0 1 1 1
Italy: 2 0 1 1 1
Germany: 2 2 0 0 6
"""
