# 515. Дано словник, у якому ключами є назви платних застосунків для платформи 
# Android, а значеннями - їх ціна (дійсне число, два знаки після десяткової крапки). 
# Надрукуйте із словника через кому з пропуском максимальну і мінімальну ціни для 
# застосунків.
'''
Вхідні дані:
Немає

Вихідні дані:
179.99, 5.0
'''
dictionary = {'app_1':123.00,\
             'app_2':179.99,\
             'app_3': 5.0,\
             'app_4':150.00,\
             'app_5':112.00}

values_list = list(dictionary.values())
print(values_list)

print(max(values_list),',',min(values_list))