#403. У мережі Інтернет кожному комп’ютері присвоюється IP-адреса (чотирьохбайтовий код, 
# який прийнято записувати у вигляді чотирьох чисел, кожне з яких може приймати значення від 
# 0 до 255 і між якими ставлять крапку). Ось приклади правильних IP-адрес: 192.168.0.1, 
# 255.0.255.255, 10.10.0.2. Програма отримує на вхід рядок з довільних символів і якщо цей 
# рядок є коректним записом IP-адреси, виведіть Yes, інакше виведіть No.
"""
Вхідні дані:
C.E.R.N
192.168.0.200
256.0.0.255

Вихідні дані:
No
Yes
No
"""
address = input("Enter your address: ").split('.')


if address[0].isdigit() and 0 <= int(address[0]) <= 255 and\
address[1].isdigit() and 0 <= int(address[1]) <= 255 and\
address[2].isdigit() and 0 <= int(address[2]) <= 255 and\
address[3].isdigit() and 0 <= int(address[3]) <= 255:
    print('Yes')
                
else:
    print('No')
            