# 555. Дано словник, у якому ключами є назви фруктів, а значеннями - список 
# значень у вигляді [Білки (г), Жири (г), Вуглеводи (г), Ккал/100 г]. Елементи у 
# словнику невпорядковані. Напишіть програму для виведення номера елемента, ключа 
# і значення елемента у словнику як у вихідних даних.
'''
Вхідні дані:
Немає

Вихідні дані:
1 Apricots   0.9 0 10.5 46
2 Grape      0.4 0 17.5 69
3 Orange     0.9 0 8.4 38
4 Ananas     0.4 0 11.8 48
5 Apples     0.4 0 11.3 46
6 Pear       0.4 0 10.7 42
7 Kiwi       0.8 0 8.1 47
'''
fruits = {'Apricots':[0.9,0,10.5,46],
          'Grape':[0.4,0,17.5,69],
          'Orange':[0.9,0,8.4,38],
          'Ananas':[0.4,0,11.8,48],
          'Apples':[0.4,0,11.3,46],
          'Pear':[0.4,0,10.7,42],
          'Kiwi':[0.8,0,8.1,47]
          }
count = 0
for key,value in fruits.items():
    count += 1
    print(f"{count} {key:10s}{value[0]} {value[1]} {value[2]} {value[3]}")