#155. Розробити програму-довідник, яка за введеним значенням радіуса r пропронуватиме користувачу допомогу в 
#обчисленні n (номер послуги): 1 - довжини кола, 2 - площі круга, 3 - об’єму кулі, 4 - площі поверхні кулі. 
#Дані вводять в такому порядку: r, n.

r = int(input("Enter a number: "))
n = int(input("Enter a number: "))

if n == 1:
    C =2 * 3.14 * r
    print(C)
elif n == 2:
    S = 3.14 * r ** 2
    print(S)
elif n == 3:
    V = (4/3) * 3.14 * r ** 3
elif n == 4:
    S1 = 4 * 3.14 * r ** 2
    print(S1)
else:
    print("Incorrect data!")