#180. Дано чотирицифрове число. Перевірте, чи є воно паліндромом. Паліндромом називається число, слово або текст, 
#які однаково читаються зліва направо і справа наліво. Наприклад, в нашому випадку, числами-паліндромами будуть: 
#1221, 4444, 9119 і т. д. Приклади інших цілих чисел-паліндромів, що не відносяться до розв’язуваної задачі: 
#2, 454, 33, 91219 і т. д.


num = int(input("Enter a number: "))

f = num // 1000
s = num % 1000 // 100
t = num % 1000 % 100 // 10
fo = num % 1000 % 100 %10
print(f,s,t,fo)


if f == s and f == t and f == fo or f == fo and  s == t:
    print(True)
else:
    print(False)