# 265. Камера спостереження реєструє в автоматичному режимі швидкість проїжджаючих повз неї автомобілів, 
# округляючи значення швидкості до цілих чисел. Необхідно визначити середню зареєстровану швидкість всіх 
# автомобілів. Якщо швидкість хоча б одного автомобіля була більше 60 км/год, виведіть Yes, 
# інакше виведіть No. Програма отримує на вхід число зафіксованих автомобілів n (1 ≤ n ≤ 30), потім 
# вказуються їх швидкості. Значення швидкості не може бути менше 1 і більше 300. Програма повинна 
# спочатку вивести середню швидкість з точністю до одного знака після десяткової крапки, потім Yes або No.
'''
Вхідні дані:

3
50
45
65

Вихідні дані:

53.3
Yes
'''
n = int(input("Enter a number: "))
num_list = []
for i in range(0,n):
    speed = int(input("Enter a number: "))
    num_list.append(speed)
    av_sp = sum(num_list)/n
print(f'{av_sp:.1f}')
if max(num_list) > 60:
    print("Yes")
else:
    print("No")
