#185. Дано три цілих числа. Упорядкуйте їх у порядку зростання. Програма повинна зчитувати три числа a, b, c. 
#Далі програма повинна змінювати їх значення так, щоб стали виконані умови a ≤ b ≤ c. 
#Резельтатом роботи програми буде виведення трійки чисел a, b, c в одному рядку. 
#При розв’язуванні задачі не можна використовувати додаткові змінні, 
#тобто єдиною допустимою операцією присвоювання є обмін значень двох змінних типу (a, b) = (b, a).

a = int(input("Enter a number: "))
b = int(input("Enter a number: "))
c = int(input("Enter a number: "))

if a >= b >= c:
   (a,c) = (c,a)
	
elif a >= c >= b:
    (a,b) = (b,a)
    
elif b >= a >= c:
    (a,c) = (c,a)
    (b,c) = (c,b)
	
elif b >= c >= a:
    (b,c) = (c,b)
	
elif c >= a >= b:
    (a,b) = (b,a)
        
print(a,b,c)