#184. Плитка шоколаду має вигляд прямокутника, розділеного на n × m частинок. Плитку шоколаду можна один раз 
#розламати по прямій на дві частини. Визначте, чи можна таким чином відламати від плитки шоколаду шматок, 
#що складається рівно з k частин. Програма отримує на вхід три числа: n, m, k і повинна вивести Yes або No.

n = int(input("Enter a number: "))
m = int(input("Enter a number: "))
k = int(input("Enter a number: "))

if (k != 1 and k < n * m) and (k % n == 0 or k % m == 0):
   print("Yes")
else:
   print("No")

