# 488.Вводиться рядок, що складається із слів, розділених пропусками. Потрібно впорядкувати 
# слова в рядку так, щоб найбільш короткі з них були спочатку рядка, а найбільш довгі в кінці. 
# Слова необхідно вивести на екран через кому і пропуск, а рядок впорядкованих слів має 
# закінчуватися крапкою.
"""
Вхідні дані:
ab aaab ba baaaaa a aba

Вихідні дані:
a, ab, ba, aba, aaab, baaaaa.
"""

lst = input("Enter the list members: ").split(" ")
lst = sorted(lst, key=len)
for i in lst:
    if i != lst[-1]:
        print(i, end = ", ")
    else:
        print(i, end = ".")
print()