#178. Робота світлофора для пішоходів запрограмована таким чином: на початку кожної години протягом трьох хвилин 
#горить зелений сигнал, потім протягом двох хвилин - червоний, а потім протягом трьох хвилин - знову зелений і т. д. 
#Дано ціле число t, що означає час в хвилинах, що минув від початку чергової години. Визначити, сигнал якого кольору 
#горить для пішоходів в цей момент.

t = int(input("Enter a number: "))
'''
0-3, 3-5, 
5-8, 8-10, 
10-13, 13-15, 
15-18, 18-20,
20-23, 23-25,
25-28, 28-30,
30-33, 33-35,
35-38, 38-40,
40-43, 43-45,
45-48, 48-50,
50-53, 53-55,
55-58, 58-60.
'''
if t % 5 == 0 or t % 5 == 1 or t % 5 == 2:
    print("Green")
else:
    print("Red")