# 461. Ви вирішили написати перетворювач коду на Python в код на Java. 
# Так як на Java прийнятий стандарт найменування CamelCase, то ви вирішили навчитися 
# перетворювати імена з underscore в цей формат. Стиль underscore характеризується 
# тим, що слова в імені пишуться маленькими літерами і розділяються між собою символом 
# підкреслення _. Стиль CamelCase означає, що кожне слово пишеться з великої літери і 
# роздільників між словами немає. Отже, вводиться один рядок, що містить ім’я, 
# записане в форматі underscore. Програма виводить рядок, що містить ім’я в форматі 
# CamelCase.
'''
Вхідні дані:
my_class
c

Вихідні дані:
MyClass
C
'''
txt = input("Enter the list members: ").split('_')
txt_string = '_'.join(txt)
print(txt_string.title())