# 482. Дано послідовність цілих чисел, які записані в одному рядку через пропуск. 
# Утворіть і надрукуйте голову (перший елемент) і хвіст (усі інші елементи) вказаної 
# послідовності не використовуючи цикли і зрізи. Довжина послідовності може бути 
# довільною.
'''
Вхідні дані:
2 10 15 9 3 6 7 11

Вихідні дані:
2
10 15 9 3 6 7 11
'''
seq = input().split()
head = seq[0]
tail = seq[1:]
print(head)
print(tail)