# 486. Використовуючи поняття списку, напишіть програму, яка створює 3D масив 
# елементів a x b x c, кожен з яких має значення 0. Значення a, b, c вводяться 
# в одному рядку через пропуск.
'''
Вхідні дані:
2 3 3
4 4 4

Вихідні дані:
[[[0, 0], [0, 0], [0, 0]], [[0, 0], [0, 0], [0, 0]], [[0, 0], [0, 0], [0, 0]]]
[[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]]
'''

a,b,c = map(int,input().split())
array_3d = [[[0 for col in range(c)]for row in range(b)]for layer in range(a)]
print(array_3d)