# 598. На вхід програми подається рядок, що містить слова, розділені пропуском. Програма 
# повинна вивести статистику довжин слів в отриманому рядку, від меншої довжини слова до більшої. 
# Словом вважається послідовність довільних символів, оточена пропусками або межами рядка. 
# Зауважте, що розділові знаки також відносяться до слова. Користувач вводить один рядок, що 
# містить послідовності англійських символів і знаків пунктуації, розділені пропуском. Для кожної 
# довжини слова, що зустрічається в заданому рядку, потрібно вказати кількість слів з такою 
# довжиною у форматі «довжина: кількість». Статистика повинна виводитися в порядку збільшення 
# довжини.
"""
Вхідні дані:
Errors should never pass silently.

Вихідні дані:
4: 1
5: 1
6: 2
9: 1
"""
text = input("Enter your row: ").split()

text_dict = {}
for i in text:
    text_dict[i]=len(i)

# list out keys and values separately
key_list = list(text_dict.keys())
val_list = list(text_dict.values())

num_dict = {}
for val in sorted(val_list):
    num_dict[val] = val_list.count(val)


for key, value in num_dict.items():
    print(f'{key}: {value}')