# 553. Дано словник, в якому ключами назви країн-чемпіонів світу з футболу, 
# а значеннями - список років, в які вони ставали чемпіонами. 
# Елементи у словнику і у списку невпорядковані. 
# Напишіть програму для впорядкування значень років в алфавітному порядку і 
# виведення словника.
'''
Вхідні дані:
Немає

Вихідні дані:
{'Brazil': [1958, 1962, 1970, 1994, 2002], 'England': [1966], 
'Italy': [1934, 1938, 1982, 2006], 'Spain': [2010], 
'Germany': [1954, 1974, 1990, 2014], 'France': [1998, 2018], 
'Uruguay': [1930, 1950], 'Argentina': [1978, 1986]}
'''
champions = {'Spain': [2010],
             'Brazil': [1958, 1962, 1970, 1994, 2002], 
             'England': [1966], 
             'Italy': [1934, 1938, 1982, 2006], 
             'Uruguay': [1930, 1950],
             'Germany': [1954, 1974, 1990, 2014], 
             'France': [1998, 2018], 
             'Argentina': [1978, 1986, 2022]}

sorted_champions = sorted(champions.items(), key = lambda x:x[1])
converted_dict = dict(sorted_champions)

print(converted_dict)
