# 278. Внесок на депозитний рахунок у банку становить d гривень. 
# Щорічно він збільшується на r відсотків, після чого дробова частина копійок відкидається. 
# Визначте, через скільки років внесок складе не менше b гривень. 
# Програма отримує на вхід три натуральних числа: d, r, b.

'''
Вхідні дані:

1000
14
2500

Вихідні дані:

7
'''
d = int(input("Enter a number: "))
r = int(input("Enter a number: "))
b = int(input("Enter a number: "))

years = 0
while d < b:
    d *=(1 + r/100)
    d = int(d * 100) / 100
    years += 1
print(years)
