#143. Ігрове поле рулетки поділено на номери від 0 до 36, які мають чорний, червоний або зелений кольори. 
#Номер 0 має зелений колір, 
##для номерів від 1 до 10, непарні номери - червоні, а парні - чорні.  --done
#Непарні номери від 11 до 18 - чорні, а парні номери - червоні.        --done
#Непарні номери від 19 до 28 - червоні, а парні номери - чорні. 
#Непарні номери від 29 до 36 - чорні, а парні номери - червоні. 
#Напишіть програму, яка отримує номер (число від 0 до 36) та показує, чи є номер зеленим, червоним або чорним. 
#Програма повинна враховувати варіант, якщо користувач вводить номер, 
#який знаходиться за межами діапазону від 0 до 36.

number = int(input('Enter a number: '))
if number == 0:
    print("Green")

elif 1 <= number <= 10 or 19 <= number <=28:
    if number % 2 != 0:
        print("Red")
    else:
        print("Black")

elif 11 <= number <= 18 or 29 <= number <= 36:
    if number % 2 != 0:
        print("Black")
    else:
        print("Red")

else:
    print('Incorrect number!')
 