#83.Дано два моменти часу в межах однієї доби. Для кожного моменту вказано
#години, хвилини і секунди. Відомо, що другий момент часу настав не раніше
#першого. Визначте скільки секунд пройшло між двома моментами часу. Програма на
#вхід отримує шість цілих чисел в окремих рядках. Перші три цілих числа
#відповідають годинам, хвилинам і секундам першого моменту, наступні три числа
#відповідають другому моменту. Години задаються числом від 0 до 23 включно.
#Хвилини і секунди - від 0 до 59.

hh_1 = int(input('Enter hours: '))
mm_1 = int(input('Enter minutes: '))
sec_1 = int(input('Enter seconds: '))
hh_2 = int(input('Enter hours: '))
mm_2 = int(input('Enter minutes: '))
sec_2 = int(input('Enter seconds: '))

diff = (hh_2*60*60+mm_2*60+sec_2) - (hh_1*60*60+mm_1*60+sec_1)
print(diff)
