# 644. Дано два дійсних числа x і y. Напишіть функцію для перевірки, чи належить 
# точка з координатами (x, y) квадрату (включаючи його межу), що має розміри 2 х 2 
# клітинки і розташований в початку системи координат. Якщо точка належить квадрату, 
# виведіть слово YES, інакше виведіть слово NO. Функція не повинна містити інструкцію 
# «якщо».
'''
Вхідні дані:
2
-1
1
1

Вихідні дані:
NO
YES
'''
def square_func(x, y):
    result = "YES" if 0 <=x <=2 and 0 <= y <=2 else "NO"
    return result

print(square_func(2,-1))
print(square_func(1,1))