#174. Потрібно визначити, чи є даний рік високосним. Нагадаємо, що високосними роками вважаються ті роки, 
#порядковий номер яких або кратний 4, але при цьому не кратний 100, або кратний 400 (наприклад, 2000-й рік був 
#високосним, а 2100-й буде невисокосним роком). Програма повинна коректно працювати на числах 1900 ≤ n ≤ 3000. 
#Виведіть Leap year. в разі, якщо рік є високосним, і Ordinary year. у протилежному випадку.

year = int(input("Enter a year between 1900 ≤ n ≤ 3000: "))

if year % 400 == 0:
    print("Leap year.")
elif year % 4 == 0 and year % 100 != 0:
    print("Leap year.")
else:
    print("Ordinary year.")