# 499. Напишіть програму, яка отримує на вхід чотирьохзначне додатне десяткове число та 
# генерує з цифр цього числа мінімально можливе чотирьохзначне число та максимально можливе 
# чотирьохзначне число. У першому рядку задано одне чотирьохзначне число. Виведіть у другому 
# рядку два числа - найменше чотирьохзначне число та найбільше чотирьохзначне число, які 
# можна отримати з цифр даного числа. Числа розділяйте одним пропуском.
"""
Вхідні дані:
1390
1010
5173

Вихідні дані:
1039 9310
1001 1100
1357 7531
"""
numbers = input("Enter your numbers: ")
list_numbers = list(numbers)
print(list_numbers)
max_num = ("".join(sorted(list_numbers, reverse=True)))

min_num = ("".join(sorted(list_numbers)))
print(min_num + ' ' + max_num)