#145. Напишіть програму для знаходження коренів квадратного рівняння a*x2 + b*x + c = 0. 
#Користувач вводить значення коефіцієнтів a, b, c. У вхідних даних наведено три пари вхідних значень коефіцієнтів, 
#а у вихідних даних - відповідні повідомлення про кількість коренів або їх відсутність.

a = float(input('Enter a: '))
b = float(input('Enter b: '))
c = float(input('Enter c: '))

D =b**2 -4*a*c

if D < 0:
    print("No roots.")
elif D == 0:
    x = -b/(2*a)
    print(x)
else:
    x1 = (-b+D**0.5)/(2*a)
    x2 = (-b-D**0.5)/(2*a)
    print(x1,x2)