# 254. Автогонщик в перший день ралі проїхав d км. Кожен наступний день він збільшував пробіг на 10% 
# від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за 
# всі дні перевищить t км і яке значення сумарного пробігу? Введення даних користувачем відбувається в 
# порядку: d, t.

'''
Вхідні дані:

10
200

Вихідні дані:

211.14 km, 33 days

'''
d = int(input("Enter a number: "))
t = int(input("Enter a number: "))

num_list =[]
while sum(num_list)<t:
    d +=0.1 * d
    num_list.append(d)
print(num_list)
print(sum(num_list))
print(len(num_list))