# 542. Дано три словники, в яких ключами є малі букви латинського алфавіту, 
# а значеннями - цілі числа. Ключі у всіх словниках – різні, їх є по 3 в кожному 
# словнику. Об’єднайте всі три словники в один і виведіть його вміст. 
# Підказка. скористайтеся оператором **, що використовується для об’єднання 
# довільної кількості словників (Python 3.5+).
'''
Вхідні дані:
Немає

Вихідні дані:
{'x': 1, 'y': 2, 'z': 3, 'w': 10, 'f': 11, 'g': 2, 'n': 10, 'm': 11, 'e': 2}
'''
dict_1 = {'x': 1, 'y': 2, 'z': 3}
dict_2 = {'w': 10, 'f': 11, 'g': 2}
dict_3 = {'n': 10, 'm': 11, 'e': 2}

merged_dict = {**dict_1, **dict_2, **dict_3}
print(merged_dict)