# 686.Напишіть функцію, яка виводить перші n рядків трикутника Паскаля. Примітка. Трикутник 
# Паскаля - це арифметична та геометрична фігура, описана Блезом Паскалем. Ряди трикутника 
# Паскаля умовно пронумеровані згори, починаючи з нульового. Кожне число в кожному ряді 
# одержуємо, додавши два числа, розміщені вгорі (зліва і справа). Якщо зліва або справа немає 
# числа, підставляємо нуль на його місце.
"""
Вхідні дані:
5

Вихідні дані:
[1]
[1, 1]
[1, 2, 1]
[1, 3, 3, 1]
[1, 4, 6, 4, 1]
"""
num = int(input("Enter the number: "))  
list1 = [] #an empty list  
for i in range(num):  
    list1.append([])  
    list1[i].append(1)  
    for j in range(1, i):  
        list1[i].append(list1[i - 1][j - 1] + list1[i - 1][j])  
    if(num != 0):  
        list1[i].append(1)  
for i in range(num):  
    print(" " * (num - i), end = " ", sep = " ")  
    for j in range(0, i + 1):  
        print('{0:6}'.format(list1[i][j]), end = " ", sep = " ")  
    print()  