#188. Провайдер здійснює підключення до Інтернету за таким тарифним планом. 
#Щомісячна абонентська плата становить a гривень, і в цю абонентську плату включено b гігабайт трафіку. 
#Невитрачені гігабайти в кінці місяця «згорають». 
#Якщо трафік перевищує b гігабайт, то кожен гігабайт трафіку понад передплачених коштує с гривень. 
#Відомо, #що за минулий місяць один з абонентів витратив d гігабайт трафіку. 
#Визначте, у скільки обійшовся йому доступ в Інтернет в минулому місяці (вважаючи, в тому числі і абонентську плату)? 
#Вводяться чотири натуральних числа a, b, c, d. Всі числа не перевищують 100. 
#Виведіть одне число - суму (у гривнях), яку абонент повинен заплатити за Інтернет.

a = int(input("Enter a number: "))
b = int(input("Enter a number: "))
c = int(input("Enter a number: "))
d = int(input("Enter a number: "))

if d <= b:
    print(a)
elif d > b:
    print(a + (d - b) * c )


