#54.В магазині канцелярських товарів Дарина купила a олівців, b ручок та c
#фломастерів. Відомо, що ціна ручки на 2 гривні більша ціни наолівець і на 7
#гривень менша ціни на фломастера. Так само відомо, що вартість олівця
#становить d гривень. Користувачем вводяться попорядку в окремих рядках
#кількість олівців, ручок, фломастерів і ціна одного олівця. Необхідно обчислити
#загальну вартість покупки.

a = int(input('Enter q-ty of pencils: '))
b = int(input('Enter q-ty of pens: '))
c = int(input('Enter q-ty of marker pens: '))
pp = int(input('Enter price of pencil: '))

total = a * pp + b * (pp+2) + c * (pp +9)
print(total)
