#173. За рейтинговою системою оцінка визначається таким чином: якщо сумарний бал учня становить не менш як 90% від 
#максимального, то виставляється оцінка 12, якщо не нижче за 70%, то виставляється оцінка 8, якщо ж не нижче за 50%, 
#то оцінка 5, у інших випадках - оцінка 2. Визначте оцінку учня, якщо він набрав n балів, а максимальне значення 
#сумарного балу становить m.

n = int(input("Enter a grade: "))
m = int(input("Enter a maximum value: "))
g = n / m* 100

if g > 90:
    print("12")
elif 90 > g >= 70:
    print("8")
elif 70 > g >= 50:
    print("5")
else:
    print("2")