# 493.В один ряд поставили n кеглів, пронумерувавши їх зліва направо числами від 1 до n. 
# Потім в цей ряд кинули k куль, при цьому i-та куля збила всі кеглі з номерами від m до h 
# включно. Визначте, які кеглі залишилися стояти на місці. Програма отримує на вхід кількість 
# кеглів n і кількість кидків k. Далі йде k пар чисел m, h, при цьому 1 ≤ m ≤ h ≤ n ≤ 100. 
# Програма повинна вивести послідовність з n символів, де j-й символ є I, якщо j-та кегля 
# залишилася стояти, або ., якщо j-та кегля була збита.
"""
Вхідні дані:
10 3
8 10
2 5
3 6

Вихідні дані:
I.....I...
"""