#У годиннику сіла батарейка, і вони стали йти вдвічі повільніше. 
#Коли на годиннику було x1 годин y1 хвилин, правильний час був a1 годин b1 хвилин. 
#Скільки часу буде насправді, коли годинник в наступний раз покаже x2 годин y2 хвилин? 
#Програма отримує на вхід числа x1, y1, a1, b1, x2, y2 в зазначеному порядку. 
#Всі числа цілі. Числа x1, a1, x2 - від 0 до 23, числа y1, b1, y2 - від 0 до 59. 
#Виведіть два числа a2 і b2, що визначають скільки буде часу насправді,коли на годиннику буде x2 годин y2 хвилин.

x1 = int(input('Enter a hours number: '))    #12
y1 = int(input('Enter a minutes number: '))  #34

a1 = int(input('Enter a hours number: '))    #10
b1 = int(input('Enter a minutes number: '))  #34

x2 = int(input('Enter a hours number: '))    #12
y2 = int(input('Enter a minutes number: '))  #35

t1 = (x1 * 60 + y1) - (a1 * 60 +b1)
t2 = (x2 * 60 + y2 ) - t1

a2 = t2 // 60
b2 = t2 % 60

print(a2,b2)