#144. На станції ремонту автомобілів працює кілька працівників. Якщо який-небудь працівник працює понад 40 годин 
#на тиждень, він отримує в 1,5 рази більше від звичайної погодинної оплати. Розробіть програму, яка розраховує 
#заробітну плату працівника, включаючи оплату за додаткові години. 
#Програма отримує на вхід два цілих числа - кількість робочих годин і ставку погодинної оплати.


working_hours = int(input('Enter a number: '))
rate_per_hour = int(input('Enter a rate per hour: '))

if working_hours > 40:
    salary = (working_hours - 40 ) * rate_per_hour * 1.5 + 40 * rate_per_hour
else:
    salary = 40 * rate_per_hour

print(salary)