# 465. Дано список з чисел та індекс елемента в списку k. Видаліть зі списку елемент 
# з індексом k, зсунувши вліво всі елементи, що стоять правіше елемента з індексом k. 
# Програма отримує на вхід список, потім число k. Програма повинна здійснювати зміщення
# безпосередньо в списку, а не робити це при виведенні елементів. Також не можна 
# використовувати додатковий список.
'''
Вхідні дані:
5 7 9 0 3 11
3

Вихідні дані:
5 7 9 3 11
'''
lst = input("Enter the list members: ").split()

n = int(input("Enter the elemet to delete index: "))
lst.pop(n)
for i in lst:
    print(i,end = ' ')
print()