# 297.Оленка вчиться ділити з залишком. 
# Вона взяла деяке число, розділила його на 2 і відкинула залишок. 
#Те, що вийшло, розділила на 3 та знову відкинула залишок. 
#Отримане число вона розділила на 4, відкинула залишок і отримала число k.
# Яке число могла вибрати Оленка спочатку? 

# Вводиться натуральне число k, що не перевершує 1000. 

# Необхідно вивести усі можливі числа, які могла б вибрати 
# спочатку Оленка, за зростанням, розділяючи їх пропусками.
'''
Вхідні дані:

1

Вихідні дані:

24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47

'''
k = int(input("Enter a number: "))
for i in range(1,100):
    if (((i//2)//3)//4) == k:
        print(i, end = ' ')